brew "chezmoi"      # dotfile manager
brew "git"          
brew "vivid"        # LS_COLORS generator
brew "gnu-sed"      # sed (GNU)
brew "coreutils"    # GNU core utilities
brew "grep"         # grep (GNU)
brew "gnu-tar"      # tar (GNU)
brew "fd"           # find alternative
brew "gawk"         # dependency for asdf node-js
brew "gpg"          # dependency for asdf node-js
brew "jq"           # json cli interpreter 
brew "mise"         # manage multiple versions of a command
brew "bat"          # syntax enabled cat
brew "httpie"       # http cli
brew "wget"         
brew "fzf"          # fuzzy finder  
brew "gh"           # github cli
brew "bash"         # use non ancient version of bash

# Add fonts casks
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-monaspace"

# Add casks
cask "1password-cli"
cask "kitty"
cask "brave-browser"
cask "slack"
cask "spotify"
